fio-test/results/write_out_conv/128k-psync-2.out
job1: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=118452: Sun Jun 23 15:42:25 2024
  write: IOPS=23.5k, BW=2939MiB/s (3082MB/s)(673GiB/234535msec); 0 zone resets
    clat (usec): min=73, max=2986, avg=331.81, stdev=80.54
     lat (usec): min=75, max=2993, avg=337.68, stdev=80.86
    clat percentiles (usec):
     |  1.00th=[  239],  5.00th=[  255], 10.00th=[  265], 20.00th=[  277],
     | 30.00th=[  285], 40.00th=[  297], 50.00th=[  310], 60.00th=[  326],
     | 70.00th=[  367], 80.00th=[  383], 90.00th=[  404], 95.00th=[  433],
     | 99.00th=[  676], 99.50th=[  840], 99.90th=[  922], 99.95th=[  955],
     | 99.99th=[ 1483]
   bw (  MiB/s): min= 2172, max= 4006, per=100.00%, avg=2944.96, stdev=43.51, samples=3737
   iops        : min=17382, max=32050, avg=23559.43, stdev=348.04, samples=3737
  lat (usec)   : 100=0.01%, 250=2.93%, 500=94.84%, 750=1.37%, 1000=0.81%
  lat (msec)   : 2=0.03%, 4=0.01%
  cpu          : usr=2.92%, sys=4.22%, ctx=5514295, majf=0, minf=119
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,5514240,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2939MiB/s (3082MB/s), 2939MiB/s-2939MiB/s (3082MB/s-3082MB/s), io=673GiB (723GB), run=234535-234535msec

Disk stats (read/write):
    dm-0: ios=48/5512729, merge=0/0, ticks=4/1753564, in_queue=1753568, util=100.00%, aggrios=11/1654272, aggrmerge=0/0, aggrticks=1/65990, aggrin_queue=65991, aggrutil=100.00%
  nvme0n1: ios=0/551424, merge=0/0, ticks=0/23646, in_queue=23647, util=100.00%
  nvme3n1: ios=0/551424, merge=0/0, ticks=0/23803, in_queue=23803, util=100.00%
  nvme1n2: ios=26/2757120, merge=0/0, ticks=3/110389, in_queue=110392, util=100.00%
  nvme4n2: ios=12/2757120, merge=0/0, ticks=1/107760, in_queue=107761, util=100.00%
  nvme2n1: ios=0/551424, merge=0/0, ticks=0/23928, in_queue=23929, util=100.00%
  nvme0n2: ios=36/2757120, merge=0/0, ticks=3/105473, in_queue=105475, util=100.00%
  nvme3n2: ios=18/2757120, merge=0/0, ticks=2/107463, in_queue=107464, util=100.00%
  nvme1n1: ios=0/551424, merge=0/0, ticks=0/23956, in_queue=23956, util=100.00%
  nvme4n1: ios=0/551424, merge=0/0, ticks=0/23890, in_queue=23891, util=100.00%
  nvme2n2: ios=20/2757120, merge=0/0, ticks=2/109592, in_queue=109594, util=100.00%